In [1]:
import pandas as pd
import numpy as np

In [6]:
data = {'color':['blue','green','yello','red','white'],
        'object':['ball','pen','pencil','paper','mug'],
        'price':[1.2, 1.0, 0.6, 0.9, 1.7]}
frame = pd.DataFrame(data)
frame

   color  object  price
0   blue    ball    1.2
1  green     pen    1.0
2  yello  pencil    0.6
3    red   paper    0.9
4  white     mug    1.7

In [8]:
frame = pd.DataFrame(data, columns=['object','price'])
frame

   object  price
0    ball    1.2
1     pen    1.0
2  pencil    0.6
3   paper    0.9
4     mug    1.7

In [9]:
frame = pd.DataFrame(data, index=['one','two','three','four','five'])
frame

       color  object  price
one     blue    ball    1.2
two    green     pen    1.0
three  yello  pencil    0.6
four     red   paper    0.9
five   white     mug    1.7

In [55]:
df = pd.DataFrame(np.arange(16).reshape(4,-1),
                 index=['red','blue','yellow','white'],
                 columns=['ball','pen','pencil','paper'])
df

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [56]:
df.index

Index(['red', 'blue', 'yellow', 'white'], dtype='object')

In [57]:
#dir(df.index)
list(df.index)

['red', 'blue', 'yellow', 'white']

In [58]:
df.columns

Index(['ball', 'pen', 'pencil', 'paper'], dtype='object')

In [59]:
list(df.columns)

['ball', 'pen', 'pencil', 'paper']

In [60]:
df.values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [61]:
type(df.values)

numpy.ndarray

In [62]:
df

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [63]:
# DF 변수[], loc[], iloc[]
df['pencil']

red        2
blue       6
yellow    10
white     14
Name: pencil, dtype: int32

In [64]:
type(df['pencil'])  # Series

pandas.core.series.Series

In [65]:
df.pencil

red        2
blue       6
yellow    10
white     14
Name: pencil, dtype: int32

In [66]:
df

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [67]:
tmp = df[['ball','paper']]
type(tmp)

pandas.core.frame.DataFrame

In [68]:
# 행 가져오기
df[0:2]

      ball  pen  pencil  paper
red      0    1       2      3
blue     4    5       6      7

In [69]:
# 변수를 이용한 boolean indexing 은 행을 선택한다
df[[True,True, False,False]]

      ball  pen  pencil  paper
red      0    1       2      3
blue     4    5       6      7

In [70]:
df

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [71]:
df['pencil'][2]  # 10
df[2:3]['pencil'][0]

10

In [72]:
df.loc['yellow','pencil']

10

In [73]:
df.loc['yellow']

ball       8
pen        9
pencil    10
paper     11
Name: yellow, dtype: int32

In [74]:
df.loc[['blue','white'], ['ball','pencil']]

       ball  pencil
blue      4       6
white    12      14

In [75]:
df.loc['blue':, 'pencil':]

        pencil  paper
blue         6      7
yellow      10     11
white       14     15

In [49]:
df.loc[[True,False,False,False], [True,False,False,False]]

     ball
red     0

In [42]:
df.iloc[2,2]

10

In [47]:
df.iloc[2, 0:2]

ball    8
pen     9
Name: yellow, dtype: int32

In [50]:
df.iloc[[True,False,False,False], [True,False,False,False]]

     ball
red     0

In [76]:
df.iloc[1:, 2:]

        pencil  paper
blue         6      7
yellow      10     11
white       14     15

In [78]:
df.index = [0,1,2,3]
df

   ball  pen  pencil  paper
0     0    1       2      3
1     4    5       6      7
2     8    9      10     11
3    12   13      14     15

In [79]:
df.loc[1:, 'pencil':]

   pencil  paper
1       6      7
2      10     11
3      14     15

In [80]:
df.iloc[1:, 2:]

   pencil  paper
1       6      7
2      10     11
3      14     15

In [81]:
df

   ball  pen  pencil  paper
0     0    1       2      3
1     4    5       6      7
2     8    9      10     11
3    12   13      14     15

In [82]:
df.index.name = 'ID'
df.columns.name = '문구'
df

문구  ball  pen  pencil  paper
ID
0      0    1       2      3
1      4    5       6      7
2      8    9      10     11
3     12   13      14     15

In [84]:
df['notebook'] = [5, 3 ,2, 4]
df

문구  ball  pen  pencil  paper  notebook
ID
0      0    1       2      3         5
1      4    5       6      7         3
2      8    9      10     11         2
3     12   13      14     15         4

In [86]:
df['notebook'][2] = 1
df

C:\Users\201-85\AppData\Local\Temp\ipykernel_4072\3281721756.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['notebook'][2] = 1

문구  ball  pen  pencil  paper  notebook
ID
0      0    1       2      3         5
1      4    5       6      7         3
2      8    9      10     11         1
3     12   13      14     15         4

In [88]:
df.isin([2, 3])

문구   ball    pen  pencil  paper  notebook
ID
0   False  False    True   True     False
1   False  False   False  False      True
2   False  False   False  False     False
3   False  False   False  False     False

In [89]:
df[df.isin([2, 3])]

문구  ball  pen  pencil  paper  notebook
ID
0    NaN  NaN     2.0    3.0       NaN
1    NaN  NaN     NaN    NaN       3.0
2    NaN  NaN     NaN    NaN       NaN
3    NaN  NaN     NaN    NaN       NaN

In [90]:
df

문구  ball  pen  pencil  paper  notebook
ID
0      0    1       2      3         5
1      4    5       6      7         3
2      8    9      10     11         1
3     12   13      14     15         4

In [91]:
del df['notebook']
df

문구  ball  pen  pencil  paper
ID
0      0    1       2      3
1      4    5       6      7
2      8    9      10     11
3     12   13      14     15

In [95]:
df['pencil'] > 6
df[df['pencil'] > 6]['pencil']

ID
2    10
3    14
Name: pencil, dtype: int32

In [96]:
df.loc[df['pencil']>6, 'pencil']

ID
2    10
3    14
Name: pencil, dtype: int32

In [99]:
# Series 를 사용한 컬럼 추가
np.random.randint(1,5,4)
df['notebook'] = pd.Series(np.random.randint(1,5,4))
df

문구  ball  pen  pencil  paper  notebook
ID
0      0    1       2      3         4
1      4    5       6      7         2
2      8    9      10     11         3
3     12   13      14     15         1

In [100]:
del df['notebook']
df

문구  ball  pen  pencil  paper
ID
0      0    1       2      3
1      4    5       6      7
2      8    9      10     11
3     12   13      14     15

In [102]:
df['paper']==7

ID
0    False
1     True
2    False
3    False
Name: paper, dtype: bool

In [103]:
df[df['paper']==7]

문구  ball  pen  pencil  paper
ID
1      4    5       6      7

In [104]:
df.loc[df['paper']==7]

문구  ball  pen  pencil  paper
ID
1      4    5       6      7

In [106]:
df.iloc[(df['paper']==7).to_list()]

문구  ball  pen  pencil  paper
ID
1      4    5       6      7

In [107]:
pd.concat([pd.DataFrame([i], columns=['A']) for i in range(5)],
    ignore_index=True)

   A
0  0
1  1
2  2
3  3
4  4

In [108]:
df

문구  ball  pen  pencil  paper
ID
0      0    1       2      3
1      4    5       6      7
2      8    9      10     11
3     12   13      14     15

In [112]:
sample_df = pd.DataFrame(np.random.randint(1,7,4).reshape(1,-1), columns=df.columns)
merge_df = pd.concat([df, sample_df], ignore_index=True)
merge_df

문구  ball  pen  pencil  paper
0      0    1       2      3
1      4    5       6      7
2      8    9      10     11
3     12   13      14     15
4      4    6       2      3

In [114]:
merge_df.drop([3,4], axis=0, inplace=True)

In [115]:
merge_df

문구  ball  pen  pencil  paper
0      0    1       2      3
1      4    5       6      7
2      8    9      10     11

In [118]:
merge_df.drop('paper', axis=1, inplace=True)
merge_df

문구  ball  pen  pencil
0      0    1       2
1      4    5       6
2      8    9      10

In [116]:
merge_df.mean(axis=0)

문구
ball      4.0
pen       5.0
pencil    6.0
paper     7.0
dtype: float64

In [117]:
merge_df.max(axis=0)

문구
ball       8
pen        9
pencil    10
paper     11
dtype: int32

In [120]:
merge_df

문구  ball  pen  pencil
0      0    1       2
1      4    5       6
2      8    9      10

In [124]:
# 변수를 이용한 인덱싱
merge_df[merge_df==0] = 1
# loc[]
merge_df.loc[0,'ball'] = 0
# iloc[]
merge_df.iloc[0,0] = 1
merge_df

문구  ball  pen  pencil  (0, ball)
0      1    1       2          1
1      4    5       6          1
2      8    9      10          1

In [129]:
#del merge_df['(0, ball)']
merge_df = merge_df[['ball','pen','pencil']]

In [130]:
merge_df

문구  ball  pen  pencil
0      1    1       2
1      4    5       6
2      8    9      10

## DataFrame CRUD examples

In [ ]:
import pandas as pd
import numpy as np

record = pd.DataFrame(columns=['번호','이름','Java','Spring','Python'])
subject_dict = {0:'Java', 1:'Spring', 2:'Python'}

In [ ]:
m_dic= {'s':'LIST', 'a':'ADD','f':'FIND','u':'UPDATE','d':'DELETE', 'x':'EXIT'}
def menu():
    print('================================================================')
    m = input('목록(s), 추가(a), 검색(번호로 검색, f), 수정(u), 삭제(d), 종료(x):')
    return m_dic.get(m)

In [ ]:
def add():
    global record
    sNum, name = input('번호 이름').split()
    name = name.strip()
    num = int(sNum.strip())
    
    s1,s2,s3 = input('Java, Spring, Python 과목 성적:').split()
    score1 = int(s1.strip())
    score2 = int(s2.strip())
    score3 = int(s3.strip())
    
    record.loc[len(record)] = [num,name,s1,s2,s3]
    record.to_csv('records.csv', index=False)
    
    print('성적입력 성공')

In [ ]:
def find():
    sNum = input('학생 번호:')
    num = int(sNum)
    row = record[record['번호']==num]
    display(row)

In [ ]:
def update():
    global record
    tmp = input('학생번호:')
    st_num = int(tmp.strip())
    
    tmp = input('과목번호(0,1,2) 새 성적:')
    subject_idx, new_score = tmp.strip().split()
    
    row_lb = record[record['번호']==st_num].index[0]
    col_lb = subject_dict.get(int(subject_idx))
    
    print(f'수정할 행({row_lb}), 열({col_lb})')
    record.loc[row_lb, col_lb] = new_score
    record.to_csv('records.csv', index=False)
    
    print('--------> 성적 수정 성공')

In [ ]:
def delete():
    sinput = input('행삭제(0), 열삭제(1)')
    tmp = int(sinput.strip())
    if tmp==0:
        sNum = input('삭제할 행번호:')
        row_lb = int(sNum.strip())
        record.drop(row_lb, axis=0, inplace=True)
    elif tmp==1:
        col_lb = input('삭제할 열이름:')
        record.drop(col_lb.strip(), axis=1, inplace=True)

In [ ]:
global record
go = True
try:
    record = pd.read_csv('records.csv')
except:
    pass

while go:
    m = menu()
    if m == 'LIST':
        display(record)
    elif m=='ADD':
        add()
    elif m=='FIND':
        find()
    elif m=='UPDATE':
        update()
    elif m=='DELETE':
        delete()
    elif m=='EXIT':
        go = False
    else:
        print('--------> 메뉴입력 오류')
        
print('--------> 프로그램 종료')